// Как работать с задачей:
// 1. Откройте сайт курса в браузере.
// 2. Найдите эту задачу на сайте.
// 3. Напишите код ниже вместо TODO.
// 4. Запустите этот файл локально в Visual Studio или другим C++17 компилятором.

// Упражнение 3. Перегрузка конструкторов
// Тема: перегрузка.
//
// Что нужно сделать:
// 1. Создать несколько конструкторов Student.
// 2. Один без параметров.
// 3. Один с name.
// 4. Один с name и age.
//
// Подсказки:
// - Конструкторы отличаются параметрами.
//
// Напишите решение ниже.
// Не смотрите в solutions до самостоятельной попытки.

// TODO: ваш код здесь

//
