// Как работать с задачей:
// 1. Откройте сайт курса в браузере.
// 2. Найдите эту задачу на сайте.
// 3. Напишите код ниже вместо TODO.
// 4. Запустите этот файл локально в Visual Studio или другим C++17 компилятором.

// Упражнение 2. try/catch
// Тема: try/catch.
//
// Что нужно сделать:
// 1. Написать try.
// 2. Внутри вызвать функцию с исключением.
// 3. Поймать const exception& error.
// 4. Вывести error.what().
//
// Подсказки:
// - Нужен #include <stdexcept>.
//
// Напишите решение ниже.
// Не смотрите в solutions до самостоятельной попытки.

// TODO: ваш код здесь

//
