// Как работать с задачей:
// 1. Откройте сайт курса в браузере.
// 2. Найдите эту задачу на сайте.
// 3. Напишите код ниже вместо TODO.
// 4. Запустите этот файл локально в Visual Studio или другим C++17 компилятором.

// Упражнение 4. Company hidden data
// Тема: Company.
//
// Что нужно сделать:
// 1. Создать class Company.
// 2. Скрыть данные в геттерах по условию.
// 3. Обработать исключения при выводе.
//
// Подсказки:
// - Ограничения доступа должны быть в геттерах.
//
// Напишите решение ниже.
// Не смотрите в solutions до самостоятельной попытки.

// TODO: ваш код здесь

//
