// Как работать с задачей:
// 1. Откройте сайт курса в браузере.
// 2. Найдите эту задачу на сайте.
// 3. Напишите код ниже вместо TODO.
// 4. Запустите этот файл локально в Visual Studio или другим C++17 компилятором.

// Упражнение 2. Вывод строки Hello
// Тема: cout.
//
// Что нужно сделать:
// 1. Подключить <iostream>.
// 2. Вывести Hello.
// 3. Вернуть 0.
//
// Подсказки:
// - Используйте cout << "Hello".
// - Можно добавить '\n'.
//
// Напишите решение ниже.
// Не смотрите в solutions до самостоятельной попытки.

// TODO: ваш код здесь

//
